node {
  name: "global_step/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
}
node {
  name: "evaluation_360x640/net/input_images"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "evaluation_360x640/Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "evaluation_360x640/ssd_preprocessing_train/ToFloat"
  op: "Cast"
  input: "evaluation_360x640/net/input_images"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "evaluation_360x640/ssd_preprocessing_train/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\366B\000\000\352B\000\000\320B"
      }
    }
  }
}
node {
  name: "evaluation_360x640/ssd_preprocessing_train/sub"
  op: "Sub"
  input: "evaluation_360x640/ssd_preprocessing_train/ToFloat"
  input: "evaluation_360x640/ssd_preprocessing_train/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "evaluation_360x640/ssd_preprocessing_train/resize_image/Shape"
  op: "Shape"
  input: "evaluation_360x640/ssd_preprocessing_train/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "evaluation_360x640/ssd_preprocessing_train/resize_image/unstack"
  op: "Unpack"
  input: "evaluation_360x640/ssd_preprocessing_train/resize_image/Shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
  attr {
    key: "num"
    value {
      i: 3
    }
  }
}
node {
  name: "evaluation_360x640/ssd_preprocessing_train/resize_image/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "evaluation_360x640/ssd_preprocessing_train/resize_image/ExpandDims"
  op: "ExpandDims"
  input: "evaluation_360x640/ssd_preprocessing_train/sub"
  input: "evaluation_360x640/ssd_preprocessing_train/resize_image/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "evaluation_360x640/ssd_preprocessing_train/resize_image/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "h\001\000\000\200\002\000\000"
      }
    }
  }
}
node {
  name: "evaluation_360x640/ssd_preprocessing_train/resize_image/ResizeBilinear"
  op: "ResizeBilinear"
  input: "evaluation_360x640/ssd_preprocessing_train/resize_image/ExpandDims"
  input: "evaluation_360x640/ssd_preprocessing_train/resize_image/size"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "align_corners"
    value {
      b: false
    }
  }
}
node {
  name: "evaluation_360x640/ssd_preprocessing_train/resize_image/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "h\001\000\000\200\002\000\000\003\000\000\000"
      }
    }
  }
}
node {
  name: "evaluation_360x640/ssd_preprocessing_train/resize_image/Reshape"
  op: "Reshape"
  input: "evaluation_360x640/ssd_preprocessing_train/resize_image/ResizeBilinear"
  input: "evaluation_360x640/ssd_preprocessing_train/resize_image/stack"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "evaluation_360x640/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "evaluation_360x640/ExpandDims"
  op: "ExpandDims"
  input: "evaluation_360x640/ssd_preprocessing_train/resize_image/Reshape"
  input: "evaluation_360x640/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "MobileNet/conv_1/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\003\000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "MobileNet/conv_1/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.1873171627521515
      }
    }
  }
}
node {
  name: "MobileNet/conv_1/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.1873171627521515
      }
    }
  }
}
node {
  name: "MobileNet/conv_1/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "MobileNet/conv_1/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "MobileNet/conv_1/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "MobileNet/conv_1/weights/Initializer/random_uniform/max"
  input: "MobileNet/conv_1/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/weights"
      }
    }
  }
}
node {
  name: "MobileNet/conv_1/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "MobileNet/conv_1/weights/Initializer/random_uniform/RandomUniform"
  input: "MobileNet/conv_1/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/weights"
      }
    }
  }
}
node {
  name: "MobileNet/conv_1/weights/Initializer/random_uniform"
  op: "Add"
  input: "MobileNet/conv_1/weights/Initializer/random_uniform/mul"
  input: "MobileNet/conv_1/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/weights"
      }
    }
  }
}
node {
  name: "MobileNet/conv_1/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "MobileNet/conv_1/weights/Assign"
  op: "Assign"
  input: "MobileNet/conv_1/weights"
  input: "MobileNet/conv_1/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "MobileNet/conv_1/weights/read"
  op: "Identity"
  input: "MobileNet/conv_1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/weights"
      }
    }
  }
}
node {
  name: "MobileNet/conv_1/kernel/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0005000000237487257
      }
    }
  }
}
node {
  name: "MobileNet/conv_1/kernel/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "MobileNet/conv_1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/weights"
      }
    }
  }
}
node {
  name: "MobileNet/conv_1/kernel/Regularizer/l2_regularizer"
  op: "Mul"
  input: "MobileNet/conv_1/kernel/Regularizer/l2_regularizer/scale"
  input: "MobileNet/conv_1/kernel/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/weights"
      }
    }
  }
}
node {
  name: "MobileNet/conv_1/biases/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "MobileNet/conv_1/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "MobileNet/conv_1/biases/Assign"
  op: "Assign"
  input: "MobileNet/conv_1/biases"
  input: "MobileNet/conv_1/biases/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "MobileNet/conv_1/biases/read"
  op: "Identity"
  input: "MobileNet/conv_1/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/biases"
      }
    }
  }
}
node {
  name: "evaluation_360x640/MobileNet/conv_1/convolution/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\003\000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "evaluation_360x640/MobileNet/conv_1/convolution/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "evaluation_360x640/MobileNet/conv_1/convolution"
  op: "Conv2D"
  input: "evaluation_360x640/ExpandDims"
  input: "MobileNet/conv_1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "evaluation_360x640/MobileNet/conv_1/BiasAdd"
  op: "BiasAdd"
  input: "evaluation_360x640/MobileNet/conv_1/convolution"
  input: "MobileNet/conv_1/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "MobileNet/conv_1/batch_norm/beta/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/batch_norm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "MobileNet/conv_1/batch_norm/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/batch_norm/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "MobileNet/conv_1/batch_norm/beta/Assign"
  op: "Assign"
  input: "MobileNet/conv_1/batch_norm/beta"
  input: "MobileNet/conv_1/batch_norm/beta/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/batch_norm/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "MobileNet/conv_1/batch_norm/beta/read"
  op: "Identity"
  input: "MobileNet/conv_1/batch_norm/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/batch_norm/beta"
      }
    }
  }
}
node {
  name: "MobileNet/conv_1/batch_norm/gamma/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/batch_norm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "MobileNet/conv_1/batch_norm/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/batch_norm/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "MobileNet/conv_1/batch_norm/gamma/Assign"
  op: "Assign"
  input: "MobileNet/conv_1/batch_norm/gamma"
  input: "MobileNet/conv_1/batch_norm/gamma/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/batch_norm/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "MobileNet/conv_1/batch_norm/gamma/read"
  op: "Identity"
  input: "MobileNet/conv_1/batch_norm/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/batch_norm/gamma"
      }
    }
  }
}
node {
  name: "MobileNet/conv_1/batch_norm/moving_mean/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/batch_norm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "MobileNet/conv_1/batch_norm/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/batch_norm/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "MobileNet/conv_1/batch_norm/moving_mean/Assign"
  op: "Assign"
  input: "MobileNet/conv_1/batch_norm/moving_mean"
  input: "MobileNet/conv_1/batch_norm/moving_mean/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/batch_norm/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "MobileNet/conv_1/batch_norm/moving_mean/read"
  op: "Identity"
  input: "MobileNet/conv_1/batch_norm/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/batch_norm/moving_mean"
      }
    }
  }
}
node {
  name: "MobileNet/conv_1/batch_norm/moving_variance/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/batch_norm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "MobileNet/conv_1/batch_norm/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/batch_norm/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "MobileNet/conv_1/batch_norm/moving_variance/Assign"
  op: "Assign"
  input: "MobileNet/conv_1/batch_norm/moving_variance"
  input: "MobileNet/conv_1/batch_norm/moving_variance/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/batch_norm/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "MobileNet/conv_1/batch_norm/moving_variance/read"
  op: "Identity"
  input: "MobileNet/conv_1/batch_norm/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_1/batch_norm/moving_variance"
      }
    }
  }
}
node {
  name: "evaluation_360x640/MobileNet/conv_1/batch_norm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "evaluation_360x640/MobileNet/conv_1/BiasAdd"
  input: "MobileNet/conv_1/batch_norm/gamma/read"
  input: "MobileNet/conv_1/batch_norm/beta/read"
  input: "MobileNet/conv_1/batch_norm/moving_mean/read"
  input: "MobileNet/conv_1/batch_norm/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "evaluation_360x640/MobileNet/conv_1/batch_norm/Relu"
  op: "Relu"
  input: "evaluation_360x640/MobileNet/conv_1/batch_norm/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/depthwise_conv/depthwise_weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/depthwise_conv/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\020\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/depthwise_conv/depthwise_weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/depthwise_conv/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.1980295032262802
      }
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/depthwise_conv/depthwise_weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/depthwise_conv/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.1980295032262802
      }
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/depthwise_conv/depthwise_weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "MobileNet/conv_ds_2/depthwise_conv/depthwise_weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/depthwise_conv/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/depthwise_conv/depthwise_weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "MobileNet/conv_ds_2/depthwise_conv/depthwise_weights/Initializer/random_uniform/max"
  input: "MobileNet/conv_ds_2/depthwise_conv/depthwise_weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/depthwise_conv/depthwise_weights"
      }
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/depthwise_conv/depthwise_weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "MobileNet/conv_ds_2/depthwise_conv/depthwise_weights/Initializer/random_uniform/RandomUniform"
  input: "MobileNet/conv_ds_2/depthwise_conv/depthwise_weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/depthwise_conv/depthwise_weights"
      }
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/depthwise_conv/depthwise_weights/Initializer/random_uniform"
  op: "Add"
  input: "MobileNet/conv_ds_2/depthwise_conv/depthwise_weights/Initializer/random_uniform/mul"
  input: "MobileNet/conv_ds_2/depthwise_conv/depthwise_weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/depthwise_conv/depthwise_weights"
      }
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/depthwise_conv/depthwise_weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/depthwise_conv/depthwise_weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 16
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/depthwise_conv/depthwise_weights/Assign"
  op: "Assign"
  input: "MobileNet/conv_ds_2/depthwise_conv/depthwise_weights"
  input: "MobileNet/conv_ds_2/depthwise_conv/depthwise_weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/depthwise_conv/depthwise_weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/depthwise_conv/depthwise_weights/read"
  op: "Identity"
  input: "MobileNet/conv_ds_2/depthwise_conv/depthwise_weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/depthwise_conv/depthwise_weights"
      }
    }
  }
}
node {
  name: "evaluation_360x640/MobileNet/conv_ds_2/depthwise_conv/depthwise/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\020\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "evaluation_360x640/MobileNet/conv_ds_2/depthwise_conv/depthwise/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "evaluation_360x640/MobileNet/conv_ds_2/depthwise_conv/depthwise"
  op: "DepthwiseConv2dNative"
  input: "evaluation_360x640/MobileNet/conv_1/batch_norm/Relu"
  input: "MobileNet/conv_ds_2/depthwise_conv/depthwise_weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/depthwise_conv/biases/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/depthwise_conv/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/depthwise_conv/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/depthwise_conv/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/depthwise_conv/biases/Assign"
  op: "Assign"
  input: "MobileNet/conv_ds_2/depthwise_conv/biases"
  input: "MobileNet/conv_ds_2/depthwise_conv/biases/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/depthwise_conv/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/depthwise_conv/biases/read"
  op: "Identity"
  input: "MobileNet/conv_ds_2/depthwise_conv/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/depthwise_conv/biases"
      }
    }
  }
}
node {
  name: "evaluation_360x640/MobileNet/conv_ds_2/depthwise_conv/BiasAdd"
  op: "BiasAdd"
  input: "evaluation_360x640/MobileNet/conv_ds_2/depthwise_conv/depthwise"
  input: "MobileNet/conv_ds_2/depthwise_conv/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/dw_batch_norm/beta/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/dw_batch_norm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/dw_batch_norm/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/dw_batch_norm/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/dw_batch_norm/beta/Assign"
  op: "Assign"
  input: "MobileNet/conv_ds_2/dw_batch_norm/beta"
  input: "MobileNet/conv_ds_2/dw_batch_norm/beta/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/dw_batch_norm/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/dw_batch_norm/beta/read"
  op: "Identity"
  input: "MobileNet/conv_ds_2/dw_batch_norm/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/dw_batch_norm/beta"
      }
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/dw_batch_norm/gamma/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/dw_batch_norm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/dw_batch_norm/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/dw_batch_norm/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/dw_batch_norm/gamma/Assign"
  op: "Assign"
  input: "MobileNet/conv_ds_2/dw_batch_norm/gamma"
  input: "MobileNet/conv_ds_2/dw_batch_norm/gamma/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/dw_batch_norm/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/dw_batch_norm/gamma/read"
  op: "Identity"
  input: "MobileNet/conv_ds_2/dw_batch_norm/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/dw_batch_norm/gamma"
      }
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/dw_batch_norm/moving_mean/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/dw_batch_norm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/dw_batch_norm/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/dw_batch_norm/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/dw_batch_norm/moving_mean/Assign"
  op: "Assign"
  input: "MobileNet/conv_ds_2/dw_batch_norm/moving_mean"
  input: "MobileNet/conv_ds_2/dw_batch_norm/moving_mean/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/dw_batch_norm/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/dw_batch_norm/moving_mean/read"
  op: "Identity"
  input: "MobileNet/conv_ds_2/dw_batch_norm/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/dw_batch_norm/moving_mean"
      }
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/dw_batch_norm/moving_variance/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/dw_batch_norm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/dw_batch_norm/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/dw_batch_norm/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/dw_batch_norm/moving_variance/Assign"
  op: "Assign"
  input: "MobileNet/conv_ds_2/dw_batch_norm/moving_variance"
  input: "MobileNet/conv_ds_2/dw_batch_norm/moving_variance/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/dw_batch_norm/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/dw_batch_norm/moving_variance/read"
  op: "Identity"
  input: "MobileNet/conv_ds_2/dw_batch_norm/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/dw_batch_norm/moving_variance"
      }
    }
  }
}
node {
  name: "evaluation_360x640/MobileNet/conv_ds_2/dw_batch_norm/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "evaluation_360x640/MobileNet/conv_ds_2/depthwise_conv/BiasAdd"
  input: "MobileNet/conv_ds_2/dw_batch_norm/gamma/read"
  input: "MobileNet/conv_ds_2/dw_batch_norm/beta/read"
  input: "MobileNet/conv_ds_2/dw_batch_norm/moving_mean/read"
  input: "MobileNet/conv_ds_2/dw_batch_norm/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "evaluation_360x640/MobileNet/conv_ds_2/dw_batch_norm/Relu"
  op: "Relu"
  input: "evaluation_360x640/MobileNet/conv_ds_2/dw_batch_norm/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/pointwise_conv/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/pointwise_conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000\020\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/pointwise_conv/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/pointwise_conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.3535533845424652
      }
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/pointwise_conv/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/pointwise_conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.3535533845424652
      }
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/pointwise_conv/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "MobileNet/conv_ds_2/pointwise_conv/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/pointwise_conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/pointwise_conv/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "MobileNet/conv_ds_2/pointwise_conv/weights/Initializer/random_uniform/max"
  input: "MobileNet/conv_ds_2/pointwise_conv/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/pointwise_conv/weights"
      }
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/pointwise_conv/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "MobileNet/conv_ds_2/pointwise_conv/weights/Initializer/random_uniform/RandomUniform"
  input: "MobileNet/conv_ds_2/pointwise_conv/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/pointwise_conv/weights"
      }
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/pointwise_conv/weights/Initializer/random_uniform"
  op: "Add"
  input: "MobileNet/conv_ds_2/pointwise_conv/weights/Initializer/random_uniform/mul"
  input: "MobileNet/conv_ds_2/pointwise_conv/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/pointwise_conv/weights"
      }
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/pointwise_conv/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/pointwise_conv/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 16
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/pointwise_conv/weights/Assign"
  op: "Assign"
  input: "MobileNet/conv_ds_2/pointwise_conv/weights"
  input: "MobileNet/conv_ds_2/pointwise_conv/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/pointwise_conv/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/pointwise_conv/weights/read"
  op: "Identity"
  input: "MobileNet/conv_ds_2/pointwise_conv/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/pointwise_conv/weights"
      }
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/pointwise_conv/kernel/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/pointwise_conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0005000000237487257
      }
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/pointwise_conv/kernel/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "MobileNet/conv_ds_2/pointwise_conv/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/pointwise_conv/weights"
      }
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/pointwise_conv/kernel/Regularizer/l2_regularizer"
  op: "Mul"
  input: "MobileNet/conv_ds_2/pointwise_conv/kernel/Regularizer/l2_regularizer/scale"
  input: "MobileNet/conv_ds_2/pointwise_conv/kernel/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/pointwise_conv/weights"
      }
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/pointwise_conv/biases/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/pointwise_conv/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/pointwise_conv/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/pointwise_conv/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/pointwise_conv/biases/Assign"
  op: "Assign"
  input: "MobileNet/conv_ds_2/pointwise_conv/biases"
  input: "MobileNet/conv_ds_2/pointwise_conv/biases/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/pointwise_conv/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "MobileNet/conv_ds_2/pointwise_conv/biases/read"
  op: "Identity"
  input: "MobileNet/conv_ds_2/pointwise_conv/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobileNet/conv_ds_2/pointwise_conv/biases"
      }
    }
  }
}
node {
  name: "evaluation_360x640/MobileNet/conv_ds_2/pointwise_conv/convolution/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000\020\000\000\000 \000\000\000"
      }
